src/Catalogs/АвтоматическиеСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>АвтоматическиеСкидки</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БонуснаяПрограмма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеПрограммы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПредоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОграниченияПоНоменклатуре</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОграниченийСкидокПоНоменклатуре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОкругления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантСовместногоПрименения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСовместногоПримененияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьГруппыВУточненииПоНоменклатуре</Name>
					<Comment>(Опт)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграниченияПоПолучателямКонтрагентам</Name>
					<Comment>По контрагентам (опт) или складам (розница).</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграниченияПоПолучателямСкладам</Name>
					<Comment>(Розница)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьРасписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУсловияПоДК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУточненияПоКатегориям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУточненияПоНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУточненияПоЦеновымГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияАвтоматическихСкидок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОбластейОграниченияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>Порядок округления</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПредоставления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПредоставленияСкидокНаценок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПравилоНачисленияБонусов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьОграниченияПоПолучателямСегментам</Name>
					<Comment>По контрагентам (опт) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьУточненияПоСегментамНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОграниченияПоПолучателям</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОграниченийСкидокПоКонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВремяПоДнямНедели</Name>
					<Comment>Время действия скидки</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Выбран</Name>
							<Comment>(Общ) Признак выбранного дня недели</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Comment>(Общ) День недели</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачала</Name>
							<Comment>(Общ) Время начала действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончания</Name>
							<Comment>(Общ) Время окончания действия скидки</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураГруппыЦеновыеГруппы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеУточнения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСкидкиНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УсловияПредоставления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УсловиеПредоставления</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УсловияПредоставленияСкидокНаценок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкидкиКонтрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкидкиСклады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПолучателиСкидкиСегменты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/СлужебныйАвтоматическиеСкидки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СлужебныйАвтоматическиеСкидки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕстьСкидкиСРасписанием</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьСкидкиСПолучателямиСклады</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьСкидкиСПолучателямиКонтрагенты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьСкидкиСУсловиямиОтСуммы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьСкидкиСУсловиямиЗаКомплектПокупки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьСкидкиСПолучателямиСегменты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПравилоНачисленияБонусов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СпособыПредоставленияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СпособыПредоставленияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Округление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоБонусныхБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентОтСуммыВВидеБонусныхБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидЦен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВариантыОграниченийСкидокПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВариантыОграниченийСкидокПоНоменклатуре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКатегориям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦеновымГруппам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСегменту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/УсловияПредоставленияСкидокНаценок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>УсловияПредоставленияСкидокНаценок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаРазовыйОбъемПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаКомплектПокупки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаНакопленныйОбъемПродаж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаДисконтнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаДеньРождения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Количество</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/АвтоматическиеСкидки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПредопределенныеПроцедурыОбработчикиСобытий

// Процедура - обработчик события ПередЗаписью.
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		
		Если ПометкаУдаления И Действует Тогда
			Действует = Ложь;
		КонецЕсли;
		
		Если СпособПредоставления = Перечисления.СпособыПредоставленияСкидокНаценок.Округление
			И ЗначениеЗаполнено(Родитель)
			Тогда
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;		
		
		ЕстьУточненияПоНоменклатуре = ?(ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре, НоменклатураГруппыЦеновыеГруппы.Количество() > 0, Ложь);
		ЕстьУточненияПоКатегориям = ?(ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям, НоменклатураГруппыЦеновыеГруппы.Количество() > 0, Ложь);
		ЕстьУточненияПоЦеновымГруппам = ?(ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоЦеновымГруппам, НоменклатураГруппыЦеновыеГруппы.Количество() > 0, Ложь);
		ЕстьУточненияПоСегментамНоменклатуры = ?(ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоСегменту, НоменклатураГруппыЦеновыеГруппы.Количество() > 0, Ложь);

		ЕстьРасписание = Ложь;
		Для Каждого ТекущаяСтрокаРасписания Из ВремяПоДнямНедели Цикл
			Если ТекущаяСтрокаРасписания.Выбран Тогда
				ЕстьРасписание = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЕстьОграниченияПоПолучателямКонтрагентам = ПолучателиСкидкиКонтрагенты.Количество() > 0;
		ЕстьОграниченияПоПолучателямСкладам = ПолучателиСкидкиСклады.Количество() > 0;
		ЕстьОграниченияПоПолучателямСегментам = ПолучателиСкидкиСегменты.Количество() > 0;

		Если ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре
			ИЛИ ВариантОграниченияПоНоменклатуре = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	АвтоматическиеСкидкиНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения
				|ПОМЕСТИТЬ ВТ_АвтоматическиеСкидкиНоменклатураГруппыЦеновыеГруппы
				|ИЗ
				|	&НоменклатураГруппыЦеновыеГруппы КАК АвтоматическиеСкидкиНоменклатураГруппыЦеновыеГруппы
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ ПЕРВЫЕ 1
				|	ВТ_АвтоматическиеСкидкиНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения
				|ИЗ
				|	ВТ_АвтоматическиеСкидкиНоменклатураГруппыЦеновыеГруппы КАК ВТ_АвтоматическиеСкидкиНоменклатураГруппыЦеновыеГруппы
				|ГДЕ
				|	ВТ_АвтоматическиеСкидкиНоменклатураГруппыЦеновыеГруппы.ЗначениеУточнения.ЭтоГруппа";
			
			Запрос.УстановитьПараметр("ПоНоменклатуре", ВариантОграниченияПоНоменклатуре);
			Запрос.УстановитьПараметр("НоменклатураГруппыЦеновыеГруппы", НоменклатураГруппыЦеновыеГруппы.Выгрузить());
			
			Результат = Запрос.Выполнить();
			
			ЕстьГруппыВУточненииПоНоменклатуре = Не Результат.Пустой();
		Иначе
			ЕстьГруппыВУточненииПоНоменклатуре = Ложь;
		КонецЕсли;
		
		// Удалим строки с пустым условием и определим, есть ли условия по дисконтным картам
		ЕстьУсловияПоДК = Ложь;
		МУдаляемыеСтроки = Новый Массив;
		Для каждого ТекущееУсловие Из УсловияПредоставления Цикл
			Если ТекущееУсловие.УсловиеПредоставления.Пустая() Тогда
				МУдаляемыеСтроки.Добавить(ТекущееУсловие);
			ИначеЕсли ТекущееУсловие.УсловиеПредоставления.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаДисконтнуюКарту
				Или ТекущееУсловие.УсловиеПредоставления.УсловиеПредоставления = Перечисления.УсловияПредоставленияСкидокНаценок.ЗаНакопленныйОбъемПродаж Тогда
				ЕстьУсловияПоДК = Истина;
			КонецЕсли;
		КонецЦикла;
		
		Для каждого УдаляемаяСтрока Из МУдаляемыеСтроки Цикл
			УсловияПредоставления.Удалить(УдаляемаяСтрока);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если СпособПредоставления <> Перечисления.СпособыПредоставленияСкидокНаценок.Сумма Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ВалютаПредоставления");
	КонецЕсли;
	
	Если Не ЭтоПравилоНачисленияБонусов Тогда
		МассивНепроверяемыхРеквизитов.Добавить("БонуснаяПрограмма");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

// Процедура - обработчик события ОбработкаЗаполнения.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		ВалютаПредоставления = Константы.ВалютаУчета.Получить();
	Иначе
		ВариантСовместногоПрименения = Константы.ВариантыСовместногоПримененияСкидокНаценок.Получить();
	КонецЕсли;
	
	Если Не ДанныеЗаполнения = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьИнформациюВСлужебномРегистреСведений(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Обновим информацию в служебном регистре сведений, который используется для оптимизации количества случаев,
	// в которых требуется выполнять расчет автоматических скидок.
	НаборЗаписей = РегистрыСведений.СлужебныйАвтоматическиеСкидки.СоздатьНаборЗаписей();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить();
	ЭлементБлокировки.Область = "РегистрСведений.ДатыЗапретаИзменения";
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
			
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.УсловияПредоставления КАК АвтоматическиеСкидкиУсловияПредоставления
			|ГДЕ
			|	АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.УсловиеПредоставления = &ЗаРазовыйОбъемПродаж
			|	И АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.КритерийОграниченияПримененияЗаОбъемПродаж = &Сумма
			|	И АвтоматическиеСкидкиУсловияПредоставления.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ПометкаУдаления
			|	И НЕ АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.УсловияПредоставления КАК АвтоматическиеСкидкиУсловияПредоставления
			|ГДЕ
			|	АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.УсловиеПредоставления = &ЗаКомплектПокупки
			|	И АвтоматическиеСкидкиУсловияПредоставления.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ПометкаУдаления
			|	И НЕ АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.ПолучателиСкидкиКонтрагенты КАК АвтоматическиеСкидкиПолучателиСкидкиКонтрагенты
			|ГДЕ
			|	АвтоматическиеСкидкиПолучателиСкидкиКонтрагенты.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиПолучателиСкидкиКонтрагенты.Ссылка.ПометкаУдаления
			|	И НЕ АвтоматическиеСкидкиПолучателиСкидкиКонтрагенты.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.ПолучателиСкидкиСклады КАК АвтоматическиеСкидкиПолучателиСкидкиСклады
			|ГДЕ
			|	АвтоматическиеСкидкиПолучателиСкидкиСклады.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиПолучателиСкидкиСклады.Ссылка.ПометкаУдаления
			|	И НЕ АвтоматическиеСкидкиПолучателиСкидкиСклады.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.ПолучателиСкидкиСегменты КАК АвтоматическиеСкидкиПолучателиСкидкиСегменты
			|ГДЕ
			|	АвтоматическиеСкидкиПолучателиСкидкиСегменты.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиПолучателиСкидкиСегменты.Ссылка.ПометкаУдаления
			|	И НЕ АвтоматическиеСкидкиПолучателиСкидкиСегменты.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.ВремяПоДнямНедели КАК АвтоматическиеСкидкиВремяПоДнямНедели
			|ГДЕ
			|	АвтоматическиеСкидкиВремяПоДнямНедели.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиВремяПоДнямНедели.Ссылка.ПометкаУдаления
			|	И НЕ АвтоматическиеСкидкиВремяПоДнямНедели.Ссылка.ЭтоПравилоНачисленияБонусов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ИСТИНА
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.УсловияПредоставления КАК АвтоматическиеСкидкиУсловияПредоставления
			|ГДЕ
			|	АвтоматическиеСкидкиУсловияПредоставления.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ПометкаУдаления
			|	И АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.УсловиеПредоставления = &ЗаДеньРождения
			|	И НЕ АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.УсловияПредоставления КАК АвтоматическиеСкидкиУсловияПредоставления
			|ГДЕ
			|	АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.УсловиеПредоставления = &ЗаРазовыйОбъемПродаж
			|	И АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.КритерийОграниченияПримененияЗаОбъемПродаж = &Сумма
			|	И АвтоматическиеСкидкиУсловияПредоставления.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ПометкаУдаления
			|	И АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.УсловияПредоставления КАК АвтоматическиеСкидкиУсловияПредоставления
			|ГДЕ
			|	АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.УсловиеПредоставления = &ЗаКомплектПокупки
			|	И АвтоматическиеСкидкиУсловияПредоставления.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ПометкаУдаления
			|	И АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.ПолучателиСкидкиКонтрагенты КАК АвтоматическиеСкидкиПолучателиСкидкиКонтрагенты
			|ГДЕ
			|	АвтоматическиеСкидкиПолучателиСкидкиКонтрагенты.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиПолучателиСкидкиКонтрагенты.Ссылка.ПометкаУдаления
			|	И АвтоматическиеСкидкиПолучателиСкидкиКонтрагенты.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.ПолучателиСкидкиСклады КАК АвтоматическиеСкидкиПолучателиСкидкиСклады
			|ГДЕ
			|	АвтоматическиеСкидкиПолучателиСкидкиСклады.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиПолучателиСкидкиСклады.Ссылка.ПометкаУдаления
			|	И АвтоматическиеСкидкиПолучателиСкидкиСклады.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.ПолучателиСкидкиСегменты КАК АвтоматическиеСкидкиПолучателиСкидкиСегменты
			|ГДЕ
			|	АвтоматическиеСкидкиПолучателиСкидкиСегменты.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиПолучателиСкидкиСегменты.Ссылка.ПометкаУдаления
			|	И АвтоматическиеСкидкиПолучателиСкидкиСегменты.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.ВремяПоДнямНедели КАК АвтоматическиеСкидкиВремяПоДнямНедели
			|ГДЕ
			|	АвтоматическиеСкидкиВремяПоДнямНедели.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиВремяПоДнямНедели.Ссылка.ПометкаУдаления
			|	И АвтоматическиеСкидкиВремяПоДнямНедели.Ссылка.ЭтоПравилоНачисленияБонусов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ИСТИНА
			|ИЗ
			|	Справочник.АвтоматическиеСкидки.УсловияПредоставления КАК АвтоматическиеСкидкиУсловияПредоставления
			|ГДЕ
			|	АвтоматическиеСкидкиУсловияПредоставления.Ссылка.Действует
			|	И НЕ АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ПометкаУдаления
			|	И АвтоматическиеСкидкиУсловияПредоставления.УсловиеПредоставления.УсловиеПредоставления = &ЗаДеньРождения
			|	И АвтоматическиеСкидкиУсловияПредоставления.Ссылка.ЭтоПравилоНачисленияБонусов
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Справочник.АвтоматическиеСкидки КАК АвтоматическиеСкидки
			|ГДЕ
			|	НЕ АвтоматическиеСкидки.ПометкаУдаления
			|	И АвтоматическиеСкидки.Действует";
		
		Запрос.УстановитьПараметр("ЗаРазовыйОбъемПродаж", Перечисления.УсловияПредоставленияСкидокНаценок.ЗаРазовыйОбъемПродаж);
		Запрос.УстановитьПараметр("ЗаКомплектПокупки", Перечисления.УсловияПредоставленияСкидокНаценок.ЗаКомплектПокупки);
		Запрос.УстановитьПараметр("ЗаДеньРождения", Перечисления.УсловияПредоставленияСкидокНаценок.ЗаДеньРождения);
		Запрос.УстановитьПараметр("Сумма", Перечисления.КритерииОграниченияПримененияСкидкиНаценкиЗаОбъемПродаж.Сумма);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		МРезультатов = Запрос.ВыполнитьПакет();
		
		Запись = НаборЗаписей.Добавить();
		Запись.ПравилоНачисленияБонусов = Ложь;
		
		// Есть скидка с условием от суммы.
		Выборка = МРезультатов[0].Выбрать();
		Запись.ЕстьСкидкиСУсловиямиОтСуммы = Выборка.Следующий();
		
		// Есть скидка за комплект покупки.
		Выборка = МРезультатов[1].Выбрать();
		Запись.ЕстьСкидкиСУсловиямиЗаКомплектПокупки = Выборка.Следующий();
		
		// Есть скидки с ограничением по контрагенту.
		Выборка = МРезультатов[2].Выбрать();
		Запись.ЕстьСкидкиСПолучателямиКонтрагенты = Выборка.Следующий();
		
		// Есть скидки с ограничением по контрагенту.
		Выборка = МРезультатов[3].Выбрать();
		Запись.ЕстьСкидкиСПолучателямиСклады = Выборка.Следующий();
		
		// Есть скидки с ограничением по сегментам.
		Выборка = МРезультатов[4].Выбрать();
		Запись.ЕстьСкидкиСПолучателямиСегменты= Выборка.Следующий();
		
		// Есть скидки с расписанием.
		Выборка = МРезультатов[5].Выбрать();
		Запись.ЕстьСкидкиСРасписанием = Выборка.Следующий();
		
		Запись = НаборЗаписей.Добавить();
		Запись.ПравилоНачисленияБонусов = Истина;
		
		// Есть правило с условием от суммы.
		Выборка = МРезультатов[6].Выбрать();
		Запись.ЕстьСкидкиСУсловиямиОтСуммы = Выборка.Следующий();
		
		// Есть правило за комплект покупки.
		Выборка = МРезультатов[7].Выбрать();
		Запись.ЕстьСкидкиСУсловиямиЗаКомплектПокупки = Выборка.Следующий();
		
		// Есть правило с ограничением по контрагенту.
		Выборка = МРезультатов[8].Выбрать();
		Запись.ЕстьСкидкиСПолучателямиКонтрагенты = Выборка.Следующий();
		
		// Есть правило с ограничением по контрагенту.
		Выборка = МРезультатов[9].Выбрать();
		Запись.ЕстьСкидкиСПолучателямиСклады = Выборка.Следующий();
		
		// Есть правило с ограничением по сегменту.
		Выборка = МРезультатов[10].Выбрать();
		Запись.ЕстьСкидкиСПолучателямиСегменты = Выборка.Следующий();
		
		// Есть правило с расписанием.
		Выборка = МРезультатов[11].Выбрать();
		Запись.ЕстьСкидкиСРасписанием = Выборка.Следующий();
		
		НаборЗаписей.Записать();
		
		// Есть действующие скидки.
		Выборка = МРезультатов[12].Выбрать();
		Константы.ЕстьАвтоматическиеСкидки.Установить(Выборка.Следующий());
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		Отказ = Истина;
		ПредставлениеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Автоматические скидки. Служебная информация по автоматическим скидкам'",
			     ОбщегоНазначения.КодОсновногоЯзыка()),
			?(Отказ, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация),
			,
			,
			ПредставлениеОшибки,
			РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
	
	Если Отказ Тогда
		ВызватьИсключение
			НСтр("ru = 'Не удалось записать служебную информацию по автоматическим скидкам, наценкам.
			           |Подробности в журнале регистрации.'");
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик события ПриЗаписи.
//
Процедура ПриЗаписи(Отказ)
	
	// Требуется обновить служебную информацию в режиме ОбменДанными.Загрузка
	Если ОбменДанными.Загрузка Тогда
		Если НЕ (ДополнительныеСвойства.Свойство("РегистрироватьСлужебныйАвтоматическиеСкидки")
			И ДополнительныеСвойства.РегистрироватьСлужебныйАвтоматическиеСкидки = Ложь) Тогда
			ОбновитьИнформациюВСлужебномРегистреСведений(Отказ);
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	ОбновитьИнформациюВСлужебномРегистреСведений(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
